In [ ]:
# Import sqlite,numpy and pandas packages

In [1]:
import sqlite3 as sql
import numpy as py
import pandas as pd

In [ ]:
# Establish a connection with the Adventure works SQL database in the jupyter notebook

In [3]:
database = "adventure works new.db"
connection = sql.connect(database)

In [ ]:
# Query the database to retrieve the AdventureWorks_Calendar table

In [5]:
query = '''SELECT * FROM AdventureWorks_Calendar'''

In [ ]:
# Display the first few rows of the dataset

In [7]:
df = pd.read_sql_query(query,connection)
df.head()

  OrderDate
0  1/1/2015
1  1/2/2015
2  1/3/2015
3  1/4/2015
4  1/5/2015

In [ ]:
# Check for missing values and data types; view summary statistics

In [9]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 912 entries, 0 to 911
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   OrderDate  912 non-null    object
dtypes: object(1)
memory usage: 7.3+ KB

       OrderDate
count        912
unique       912
top     1/1/2015
freq           1

In [11]:
print(df.describe())

       OrderDate
count        912
unique       912
top     1/1/2015
freq           1

In [ ]:
# Query database to retrieve the table AdventureWorks_Customers and view initial rows of the table

In [17]:
query = ''' SELECT* FROM AdventureWorks_Customers'''

In [19]:
df = pd.read_sql_query(query, connection)
df.head()

,CustomerKey,Prefix,FirstName,LastName,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner
0,11000,MR.,JON,YANG,4/8/1966,M,M,jon24@adventure-works.com,"$90,000",2,Bachelors,Professional,Y
1,11001,MR.,EUGENE,HUANG,5/14/1965,S,M,eugene10@adventure-works.com,"$60,000",3,Bachelors,Professional,N
2,11002,MR.,RUBEN,TORRES,8/12/1965,M,M,ruben35@adventure-works.com,"$60,000",3,Bachelors,Professional,Y
3,11003,MS.,CHRISTY,ZHU,2/15/1968,S,F,christy12@adventure-works.com,"$70,000",0,Bachelors,Professional,N
4,11004,MRS.,ELIZABETH,JOHNSON,8/8/1968,S,F,elizabeth5@adventure-works.com,"$80,000",5,Bachelors,Professional,Y

In [ ]:
# Check for missing values and data types; view summary statistics

In [21]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18148 entries, 0 to 18147
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CustomerKey     18148 non-null  int64
 1   Prefix          18018 non-null  object
 2   FirstName       18148 non-null  object
 3   LastName        18148 non-null  object
 4   BirthDate       18148 non-null  object
 5   MaritalStatus   18148 non-null  object
 6   Gender          18148 non-null  object
 7   EmailAddress    18148 non-null  object
 8   AnnualIncome    18148 non-null  object
 9   TotalChildren   18148 non-null  int64
 10  EducationLevel  18148 non-null  object
 11  Occupation      18148 non-null  object
 12  HomeOwner       18148 non-null  object
dtypes: int64(2), object(11)
memory usage: 1.8+ MB

        CustomerKey  TotalChildren
count  18148.000000   18148.000000
mean   20247.470465       1.843619
std     5336.245656       1.613203
min    11000.000000       0.000000
25%    15626.750000       0.000000
50%    20252.500000       2.000000
75%    24868.250000       3.000000
max    29483.000000       5.000000

In [ ]:
# Check for missing data sum

In [23]:
missing_data = df.isnull().sum()

In [25]:
print(missing_data)

CustomerKey         0
Prefix            130
FirstName           0
LastName            0
BirthDate           0
MaritalStatus       0
Gender              0
EmailAddress        0
AnnualIncome        0
TotalChildren       0
EducationLevel      0
Occupation          0
HomeOwner           0
dtype: int64

In [ ]:
# Drop missing values

In [27]:
df.dropna(subset=['Prefix'], inplace=True)

In [29]:
print(df.dropna)

<bound method DataFrame.dropna of        CustomerKey Prefix  FirstName LastName   BirthDate MaritalStatus  \
0            11000    MR.        JON     YANG    4/8/1966             M
1            11001    MR.     EUGENE    HUANG   5/14/1965             S
2            11002    MR.      RUBEN   TORRES   8/12/1965             M
3            11003    MS.    CHRISTY      ZHU   2/15/1968             S
4            11004   MRS.  ELIZABETH  JOHNSON    8/8/1968             S
...            ...    ...        ...      ...         ...           ...
18143        29479    MR.      TOMMY     TANG    7/4/1958             M
18144        29480   MRS.       NINA     RAJI  11/10/1960             S
18145        29481    MR.       IVAN     SURI    1/5/1960             S
18146        29482    MR.    CLAYTON    ZHANG    3/5/1959             M
18147        29483    MR.      J�SUS  NAVARRO   12/8/1959             M

      Gender                    EmailAddress AnnualIncome  TotalChildren  \
0          M       jon24@adventure-works.com      $90,000              2
1          M    eugene10@adventure-works.com      $60,000              3
2          M     ruben35@adventure-works.com      $60,000              3
3          F   christy12@adventure-works.com      $70,000              0
4          F  elizabeth5@adventure-works.com      $80,000              5
...      ...                             ...          ...            ...
18143      M      tommy2@adventure-works.com      $30,000              1
18144      F      nina21@adventure-works.com      $30,000              3
18145      M       ivan0@adventure-works.com      $30,000              3
18146      M    clayton0@adventure-works.com      $30,000              3
18147      M      j�sus9@adventure-works.com      $30,000              0

        EducationLevel    Occupation HomeOwner
0            Bachelors  Professional         Y
1            Bachelors  Professional         N
2            Bachelors  Professional         Y
3            Bachelors  Professional         N
4            Bachelors  Professional         Y
...                ...           ...       ...
18143  Graduate Degree      Clerical         Y
18144  Graduate Degree      Clerical         Y
18145  Graduate Degree      Clerical         N
18146        Bachelors      Clerical         Y
18147        Bachelors      Clerical         Y

[18018 rows x 13 columns]>

In [31]:
print(missing_data)

CustomerKey         0
Prefix            130
FirstName           0
LastName            0
BirthDate           0
MaritalStatus       0
Gender              0
EmailAddress        0
AnnualIncome        0
TotalChildren       0
EducationLevel      0
Occupation          0
HomeOwner           0
dtype: int64

In [33]:
df.dropna(inplace=True)

In [ ]:
# Query database to retrieve the table AdventureWorks_Returns and view initial rows of the table

In [35]:
query = '''SELECT* FROM AdventureWorks_Returns'''

In [37]:
df = pd.read_sql_query(query,connection)
df.head()

  ReturnDate  TerritoryKey  ProductKey  ReturnQuantity
0  1/18/2015             9         312               1
1  1/18/2015            10         310               1
2  1/21/2015             8         346               1
3  1/22/2015             4         311               1
4   2/2/2015             6         312               1

In [ ]:
# Check for missing values and data types; view summary statistics

In [39]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1809 entries, 0 to 1808
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ReturnDate      1809 non-null   object
 1   TerritoryKey    1809 non-null   int64
 2   ProductKey      1809 non-null   int64
 3   ReturnQuantity  1809 non-null   int64
dtypes: int64(3), object(1)
memory usage: 56.7+ KB

       TerritoryKey   ProductKey  ReturnQuantity
count   1809.000000  1809.000000     1809.000000
mean       6.259812   443.460475        1.010503
std        2.948103   115.326651        0.101973
min        1.000000   214.000000        1.000000
25%        4.000000   369.000000        1.000000
50%        7.000000   479.000000        1.000000
75%        9.000000   529.000000        1.000000
max       10.000000   606.000000        2.000000

In [ ]:
# Check for null values

In [41]:
df.isnull().sum()

ReturnDate        0
TerritoryKey      0
ProductKey        0
ReturnQuantity    0
dtype: int64

In [ ]:
# Query database to retrieve the table AdventureWorks_Territories and view initial rows of the table

In [43]:
query = '''SELECT * FROM AdventureWorks_Territories'''

In [45]:
df = pd.read_sql_query(query,connection)
df.head()

   TerritoryKey     Region        Country      Continent
0             1  Northwest  United States  North America
1             2  Northeast  United States  North America
2             3    Central  United States  North America
3             4  Southwest  United States  North America
4             5  Southeast  United States  North America

In [ ]:
# Check for missing values and data types; view summary statistics; count null values

In [47]:
df.info()
df.describe()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   TerritoryKey  10 non-null     int64
 1   Region        10 non-null     object
 2   Country       10 non-null     object
 3   Continent     10 non-null     object
dtypes: int64(1), object(3)
memory usage: 452.0+ bytes

TerritoryKey    0
Region          0
Country         0
Continent       0
dtype: int64

In [ ]:
# Query database to retrieve the table AdventureWorks_Territories and view initial rows of the table

In [49]:
query = '''SELECT * FROM AdventureWorks_Products'''

In [64]:
df = pd.read_sql_query(query,connection)
df.head()

,ProductKey,ProductSubcategoryKey,ProductSKU,ProductName,ModelName,ProductDescription,ProductColor,ProductSize,ProductStyle,ProductCost,ProductPrice
0,214,31,HL-U509-R,"Sport-100 Helmet, Red",Sport-100,"Universal fit, well-vented, lightweight , snap...",Red,0,0,13.0863,34.9900
1,215,31,HL-U509,"Sport-100 Helmet, Black",Sport-100,"Universal fit, well-vented, lightweight , snap...",Black,0,0,12.0278,33.6442
2,218,23,SO-B909-M,"Mountain Bike Socks, M",Mountain Bike Socks,Combination of natural and synthetic fibers st...,White,M,U,3.3963,9.5000
3,219,23,SO-B909-L,"Mountain Bike Socks, L",Mountain Bike Socks,Combination of natural and synthetic fibers st...,White,L,U,3.3963,9.5000
4,220,31,HL-U509-B,"Sport-100 Helmet, Blue",Sport-100,"Universal fit, well-vented, lightweight , snap...",Blue,0,0,12.0278,33.6442

In [ ]:
# Check for missing values and data types; view summary statistics; count null values

In [66]:
df.info()
df.describe()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293 entries, 0 to 292
Data columns (total 11 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ProductKey             293 non-null    int64
 1   ProductSubcategoryKey  293 non-null    int64
 2   ProductSKU             293 non-null    object
 3   ProductName            293 non-null    object
 4   ModelName              293 non-null    object
 5   ProductDescription     293 non-null    object
 6   ProductColor           293 non-null    object
 7   ProductSize            293 non-null    object
 8   ProductStyle           293 non-null    object
 9   ProductCost            293 non-null    float64
 10  ProductPrice           293 non-null    float64
dtypes: float64(2), int64(2), object(7)
memory usage: 25.3+ KB

ProductKey               0
ProductSubcategoryKey    0
ProductSKU               0
ProductName              0
ModelName                0
ProductDescription       0
ProductColor             0
ProductSize              0
ProductStyle             0
ProductCost              0
ProductPrice             0
dtype: int64

In [ ]:
# Query database to retrieve the table AdventureWorks_Product_Catergories and view initial rows of the table

In [72]:
query= '''SELECT * FROM AdventureWorks_Product_Categories'''

In [74]:
df= pd.read_sql_query(query,connection)
df.head()

   ProductCategoryKey CategoryName
0                   1        Bikes
1                   2   Components
2                   3     Clothing
3                   4  Accessories

In [ ]:
# Check for missing values and data types; view summary statistics; count null values

In [76]:
df.info()
df.describe()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ProductCategoryKey  4 non-null      int64
 1   CategoryName        4 non-null      object
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

ProductCategoryKey    0
CategoryName          0
dtype: int64

In [ ]:
# Query database to retrieve the table AdventureWorks_Product_Subcatergories and view initial rows of the table

In [84]:
query= '''select * from AdventureWorks_Product_Subcategories'''

In [86]:
df= pd.read_sql_query(query,connection)

In [88]:
df.head()

   ProductSubcategoryKey  SubcategoryName  ProductCategoryKey
0                      1   Mountain Bikes                   1
1                      2       Road Bikes                   1
2                      3    Touring Bikes                   1
3                      4       Handlebars                   2
4                      5  Bottom Brackets                   2

In [ ]:
# Check for missing values and data types; view summary statistics; count null values

In [90]:
df.info()
df.describe()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37 entries, 0 to 36
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ProductSubcategoryKey  37 non-null     int64
 1   SubcategoryName        37 non-null     object
 2   ProductCategoryKey     37 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1020.0+ bytes

ProductSubcategoryKey    0
SubcategoryName          0
ProductCategoryKey       0
dtype: int64

In [ ]:
# Query database to retrieve the table AdventureWorks_Sales and view initial rows of the table

In [92]:
query = '''select* from AdventureWorks_Sales'''

In [94]:
df = pd.read_sql_query(query,connection)
df.head()

,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,TerritoryKey,OrderLineItem,OrderQuantity,Region
0,1/1/2015,9/21/2001,SO45080,332,14657,1,1,1,United States NorthWest
1,1/1/2015,12/5/2001,SO45079,312,29255,4,1,1,United States SouthWest
2,1/1/2015,10/29/2001,SO45082,350,11455,9,1,1,Australia
3,1/1/2015,11/16/2001,SO45081,338,26782,6,1,1,Canada
4,1/2/2015,12/15/2001,SO45083,312,14947,10,1,1,United Kingdom

In [ ]:
# Check for missing values and data types; view summary statistics; count null values

In [96]:
df.info()
df.describe()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56046 entries, 0 to 56045
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   OrderDate      56046 non-null  object
 1   StockDate      56046 non-null  object
 2   OrderNumber    56046 non-null  object
 3   ProductKey     56046 non-null  int64
 4   CustomerKey    56046 non-null  int64
 5   TerritoryKey   56046 non-null  int64
 6   OrderLineItem  56046 non-null  int64
 7   OrderQuantity  56046 non-null  int64
 8   Region         56046 non-null  object
dtypes: int64(5), object(4)
memory usage: 3.8+ MB

OrderDate        0
StockDate        0
OrderNumber      0
ProductKey       0
CustomerKey      0
TerritoryKey     0
OrderLineItem    0
OrderQuantity    0
Region           0
dtype: int64

In [ ]:
# Check for duplicate rows

In [98]:
duplicate_rows = df[df.duplicated()]
print(duplicate_rows)

Empty DataFrame
Columns: [OrderDate, StockDate, OrderNumber, ProductKey, CustomerKey, TerritoryKey, OrderLineItem, OrderQuantity, Region]
Index: []

In [ ]:
# Converting Datatypes

In [100]:
df['CustomerKey'] = pd.to_numeric(df['CustomerKey'], errors = 'coerce')

In [102]:
df['OrderLineItem'] = pd.to_numeric(df['OrderLineItem'], errors = 'coerce')
df['TerritoryKey'] = pd.to_numeric(df['TerritoryKey'], errors = 'coerce')
df['ProductKey'] = pd.to_numeric(df['ProductKey'], errors = 'coerce')
df['OrderQuantity'] = pd.to_numeric(df['OrderQuantity'], errors = 'coerce')
df['OrderDate'] = pd.to_datetime(df['OrderDate'], errors = 'coerce')
df['StockDate'] = pd.to_datetime(df['StockDate'], errors = 'coerce')

In [ ]:
# checking  for unique values

In [104]:
unique_values = df['OrderNumber'].is_unique
print(f"OrderNumber has unique values :{unique_values}")

OrderNumber has unique values :False

In [ ]:
# Listing unique values

In [106]:
unique_values = df['OrderNumber'].unique()
print(unique_values)

['SO45080' 'SO45079' 'SO45082' ... 'SO74105' 'SO74143' 'SO74124']

In [ ]:
# counting unique values

In [108]:
num_unique_values = df['OrderNumber'].nunique()
print(num_unique_values)

25164